console.log('любопытной варваре на базаре нос оторвали... :)');
console.log('возможно, на сайте есть какие-то интересные пасхалки. удачи найти все');

function easter1() {
  console.log('возможно, стоит решить квадратное уравнение? 3x^2 + 2x − 16 = 0\nответ вводить через solve(ответ), вводить ПОЛОЖИТЕЛЬНЫЙ корень');
}

function solve(num) {
  if(num === 2) console.log('поздравляю, время успешно потрачено, ибо тут ничего нет xD');
  else console.log('УЧИ МАТЕМАТИКУ НЕУЧ');
}

function message() {
  alert('увы, пришлось вырезать контент с этой картинки :(');
}